### OMKAR R DESHPANDE

### REG NO : 23-27-13

In [195]:
import pandas as pd

In [196]:
df = pd.read_csv("housingdata.csv")

In [197]:
df.head(6)

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

In [198]:
df.columns

Index(['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT'], dtype='object')

In [199]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [200]:
df["STATE"].shape

(9,)

In [201]:
df["STATE"].nunique()

6

In [202]:
df.isna().values.tolist()

[[False, False, False, False, False, False],
 [False, False, False, False, False, False],
 [False, False, False, True, False, False],
 [False, False, False, False, True, False],
 [True, False, False, False, False, False],
 [False, False, False, True, False, False],
 [False, False, False, False, False, False],
 [False, False, False, False, False, True],
 [False, False, False, False, False, False]]

In [203]:
df1 = df.dropna(subset="NUM_BEDROOMS")

In [204]:
df1

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [205]:
df["NUM_BATH"] = df["NUM_BATH"].fillna(method="ffill")
df

C:\Users\omkar\AppData\Local\Temp\ipykernel_4528\3977022462.py:1: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["NUM_BATH"] = df["NUM_BATH"].fillna(method="ffill")

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1        1   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [206]:
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1        1   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN
8  100009000.0           HP      21212           na        2  1800

In [207]:
df["SQ_FT"] = pd.to_numeric(df["SQ_FT"], errors="coerce")

In [208]:
mean_sq_ft = df["SQ_FT"].mean()
df["SQ_FT"].fillna(mean_sq_ft, inplace=True)

In [209]:
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3        1  1000.0
1  100002000.0  MAHARASHTRA      21325            3      1.5  1100.0
2  100003000.0           AP    2541654          NaN        1   850.0
3  100004000.0           TN     321321            1        1   700.0
4          NaN           TN  589465645            3        2  1600.0
5  100006000.0           TN   65465466          NaN        1   800.0
6  100007000.0        ASSAM    3222321            2   HURLEY   950.0
7  100008000.0           HP      23131            1        1  1100.0
8  100009000.0           HP      21212           na        2  1800.0

In [210]:
sum(df["SQ_FT"])

9900.0

In [211]:
df["NUM_STORE"] = 1

In [212]:
df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1100.0,1
2,100003000.0,AP,2541654,NaN,1,850.0,1
3,100004000.0,TN,321321,1,1,700.0,1
4,NaN,TN,589465645,3,2,1600.0,1
5,100006000.0,TN,65465466,NaN,1,800.0,1
6,100007000.0,ASSAM,3222321,2,HURLEY,950.0,1
7,100008000.0,HP,23131,1,1,1100.0,1
8,100009000.0,HP,21212,na,2,1800.0,1

In [213]:
df_tn = df[df["STATE"] == "TN"]
df_tn

           PID STATE      PRICE NUM_BEDROOMS NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1        1   700.0          1
4          NaN    TN  589465645            3        2  1600.0          1
5  100006000.0    TN   65465466          NaN        1   800.0          1

In [215]:
df3 = df[df["SQ_FT"]>1000]
df3

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
1,100002000.0,MAHARASHTRA,21325,3,1.5,1100.0,1
4,NaN,TN,589465645,3,2,1600.0,1
7,100008000.0,HP,23131,1,1,1100.0,1
8,100009000.0,HP,21212,na,2,1800.0,1

In [216]:
df4 = df.iloc[0:3,0:3]

In [217]:
df4

           PID        STATE    PRICE
0  100001000.0           MP   321654
1  100002000.0  MAHARASHTRA    21325
2  100003000.0           AP  2541654

In [228]:
df["PRICE_PER_SQ_FT"] = df["PRICE"] / df["SQ_FT"]

In [235]:
avg_price = df.groupby("STATE")["PRICE_PER_SQ_FT"].mean()

In [236]:
avg_price.idxmax()

'TN'

In [237]:
avg_price.max()

150235.63020833334